Documents/РегламентированныйОтчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>РегламентированныйОтчет</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидУчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыУчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеПериода</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПорядкиОкругленияОтчетности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТочностьЕдиницыИзмерения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтчетНаКонецПрошлогоГода</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РегламентированныйОтчет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтчетНаКонецПозапрошлогоГода</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РегламентированныйОтчет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтчетЗаПоследнийКвартал</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеОтчета</Name>
					<Comment>Наименование регламентированного отчета</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникОтчета</Name>
					<Comment>Имя объекта метаданных Отчет</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>254</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыбраннаяФорма</Name>
					<Comment>Выбранная форма</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>254</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РедакцияФормы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>254</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДанныеОтчета</Name>
					<Comment>Сохраненные данные отчета</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусОтчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКорректировки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НестандартныйПериод</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПереходНаМСФО9</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/РегламентированныйОтчет/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаКлиенте
Процедура ОтчетыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
	Если Копирование Тогда
		
		ТекущиеДанные = Элементы.Отчеты.ТекущиеДанные;
		
		Если ТекущиеДанные <> Неопределено Тогда
			
			Ссылка = ТекущиеДанные.Ссылка;
			ПараметрыФормы = Новый Структура("ЗначениеКопирования", Ссылка); 
			ОткрытьФорму("Документ.РегламентированныйОтчет.ФормаОбъекта", ПараметрыФормы, ЭтаФорма);
			
		КонецЕсли;
		
	Иначе
		
		СоздатьОтчет();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьОтчет(знач ПараметрыФормы = Неопределено)
		
	Если ПараметрыФормы = Неопределено Тогда
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("СчетДоверительногоУправления", ЭтаФорма.СчетДоверительногоУправления);
		ПараметрыФормы.Вставить("Организация", 				ЭтаФорма.Организация);
		ПараметрыФормы.Вставить("ДатаНачалаПериодаОтчета", 	ЭтаФорма.НачалоПериода);
		ПараметрыФормы.Вставить("ДатаКонцаПериодаОтчета", 	ЭтаФорма.КонецПериода);
		ПараметрыФормы.Вставить("ПредставлениеВидаОтчета",	ЭтаФорма.ВидОтчета);
		ПараметрыФормы.Вставить("ИмяФормы","");
	
	КонецЕсли; 
	
	ЭтаФорма.ПараметрыВыбораФормыСоздания = Неопределено;
	ОписаниеОповещенияОЗакрытииФормыСозданияОтчета = Новый ОписаниеОповещения("ВыполнитьПослеЗакрытияСозданияОтчета", ЭтотОбъект);
	ОткрытьФорму("Документ.РегламентированныйОтчет.Форма.ФормаСозданияОтчета", ПараметрыФормы, ЭтаФорма,,,, 
				ОписаниеОповещенияОЗакрытииФормыСозданияОтчета, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
КонецПроцедуры
			
&НаКлиенте
Процедура ВыполнитьПослеЗакрытияСозданияОтчета(Параметр  = Неопределено, ДопПараметр = Неопределено) Экспорт

	Если ЭтаФорма.ПараметрыВыбораФормыСоздания = Неопределено Тогда
		Возврат;	
	КонецЕсли; 
	
	СоздатьОтчет(ЭтаФорма.ПараметрыВыбораФормыСоздания);
			
КонецПроцедуры			

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтаФорма.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	
	СохраненныйСпособОтбораПериода = ХранилищеНастроекДанныхФорм.Загрузить(ЭтаФорма.ИмяФормы, "ФормаСпискаРегламентированныйОтчет_ТолькоУказанныйПериод");
	Если СохраненныйСпособОтбораПериода <> Неопределено Тогда
		ЭтаФорма.ТолькоУказанныйПериод = СохраненныйСпособОтбораПериода;
	КонецЕсли;
	СохраненныйПериодОтчета = ХранилищеНастроекДанныхФорм.Загрузить(ЭтаФорма.ИмяФормы, "ФормаСпискаРегламентированныйОтчет_ПериодОтчета");
	Если СохраненныйПериодОтчета <> Неопределено Тогда
		ЭтаФорма.ПериодОтчета = СохраненныйПериодОтчета;
	КонецЕсли;
	СохраненныйНачалоПериода = ХранилищеНастроекДанныхФорм.Загрузить(ЭтаФорма.ИмяФормы, "ФормаСпискаРегламентированныйОтчет_НачалоПериода");
	Если СохраненныйНачалоПериода <> Неопределено Тогда
		ЭтаФорма.НачалоПериода = СохраненныйНачалоПериода;
	КонецЕсли;
	СохраненныйКонецПериода = ХранилищеНастроекДанныхФорм.Загрузить(ЭтаФорма.ИмяФормы, "ФормаСпискаРегламентированныйОтчет_КонецПериода");
	Если СохраненныйКонецПериода <> Неопределено Тогда
		ЭтаФорма.КонецПериода = СохраненныйКонецПериода;
	КонецЕсли;
	
	СписокВидовОтчетов = Документы.РегламентированныйОтчет.ПолучитьСписокВидовРегламентированныхОтчетов();
	Для каждого ТекВидОтчета Из СписокВидовОтчетов Цикл
	
		Элементы.ОтборВидОтчета.СписокВыбора.Добавить(ТекВидОтчета.Значение, ТекВидОтчета.Представление);
	
	КонецЦикла; 
	
	Элементы.ОтборОрганизация.Видимость = РольДоступна("ПолныеПрава"); 
	
КонецПроцедуры

&НаКлиенте
Процедура ОтчетыПередНачаломИзменения(Элемент, Отказ)
	
	Отказ = Истина;
	
	ТекущиеДанные = Элементы.Отчеты.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		
		ПоказатьЗначение(,ТекущиеДанные.Ссылка);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтчетыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда

		Ссылка = ТекущиеДанные.Ссылка;
		ПоказатьЗначение(,Ссылка);
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура СохранитьНастройки()
		
	ХранилищеНастроекДанныхФорм.Сохранить(ЭтаФорма.ИмяФормы, "ФормаСпискаРегламентированныйОтчет_ТолькоУказанныйПериод", ЭтаФорма.ТолькоУказанныйПериод);
	ХранилищеНастроекДанныхФорм.Сохранить(ЭтаФорма.ИмяФормы, "ФормаСпискаРегламентированныйОтчет_ПериодОтчета",  ЭтаФорма.ПериодОтчета);
	ХранилищеНастроекДанныхФорм.Сохранить(ЭтаФорма.ИмяФормы, "ФормаСпискаРегламентированныйОтчет_НачалоПериода", ЭтаФорма.НачалоПериода);
	ХранилищеНастроекДанныхФорм.Сохранить(ЭтаФорма.ИмяФормы, "ФормаСпискаРегламентированныйОтчет_КонецПериода",  ЭтаФорма.КонецПериода);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ТекущаяДатаНаСервере()
	
	Возврат ТекущаяДатаСеанса();
	
КонецФункции

&НаКлиенте
Процедура ОтборПериодНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущаяДатаСеанса = Неопределено;
	
	НачалоПериодаВыбор = НачалоПериода;
	КонецПериодаВыбор  = КонецПериода;
	
	Если НЕ ЗначениеЗаполнено(НачалоПериодаВыбор) Тогда
		ТекущаяДатаСеанса = ТекущаяДатаНаСервере();
		НачалоПериодаВыбор = НачалоКвартала(ТекущаяДатаСеанса);
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(КонецПериодаВыбор) Тогда
		Если НЕ ЗначениеЗаполнено(ТекущаяДатаСеанса) Тогда
			ТекущаяДатаСеанса = ТекущаяДатаНаСервере();
		КонецЕсли;
		КонецПериодаВыбор = КонецКвартала(ТекущаяДатаСеанса);
	КонецЕсли;
	
	ПараметрыВыбора = Новый Структура("НачалоПериода, КонецПериода, ВидПериода, ТолькоУказанныйПериод"
									 , НачалоПериодаВыбор, КонецПериодаВыбор, Неопределено, ТолькоУказанныйПериод);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОтборВыбратьПериодЗавершение", ЭтаФорма);
	
	ПолноеИмяФормыВыбораПериода = "Документ.РегламентированныйОтчет.Форма.ВыборСтандартногоПериодаГодКвартал";
	
	ОткрытьФорму(ПолноеИмяФормыВыбораПериода, ПараметрыВыбора, , , , , ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборВыбратьПериодЗавершение(РезультатВыбора, ДопПараметры) Экспорт
	
	Если ТипЗнч(РезультатВыбора) <> Тип("Структура")
		 ИЛИ НЕ РезультатВыбора.Свойство("НачалоПериода")
		 ИЛИ НЕ РезультатВыбора.Свойство("КонецПериода") Тогда
		
		Возврат;
		
	КонецЕсли;
	
	НачалоПериода = ?(ЗначениеЗаполнено(РезультатВыбора.НачалоПериода), НачалоДня(РезультатВыбора.НачалоПериода), РезультатВыбора.НачалоПериода);
	КонецПериода  = ?(ЗначениеЗаполнено(РезультатВыбора.КонецПериода),  КонецДня(РезультатВыбора.КонецПериода),   РезультатВыбора.КонецПериода);
	
	ПериодОтчета = ПредставлениеПериода(НачалоПериода, КонецПериода, "ФП=Истина");
	
	УстановитьОтборы(ЭтаФорма);
	
	СохранитьНастройки();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборСчетДоверительногоУправленияПриИзменении(Элемент)
	УстановитьОтборы(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ОтборОрганизацияПриИзменении(Элемент)
	УстановитьОтборы(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ОтборВидОтчетаПриИзменении(Элемент)
	
	УстановитьОтборы(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПериодОтчетаПриИзменении(Элемент)
	
	СохранитьНастройки();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборСчетДоверительногоУправленияОчистка(Элемент, СтандартнаяОбработка)
	УстановитьОтборы(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ОтборОрганизацияОчистка(Элемент, СтандартнаяОбработка)
	УстановитьОтборы(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ОтборПериодОтчетаОчистка(Элемент, СтандартнаяОбработка)
	
	НачалоПериода = Дата(1, 1, 1);
	КонецПериода  = Дата(1, 1, 1);
	
	УстановитьОтборы(ЭтаФорма);
	
	СохранитьНастройки();
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтборы(Форма)
	
	ОтборДинамическогоСписка = Форма.Отчеты.КомпоновщикНастроек.Настройки.Отбор;
	
	ОтборДинамическогоСписка.Элементы.Очистить();
	
	ОтборВидОтчета        = ОтборДинамическогоСписка.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборОрганизация      = ОтборДинамическогоСписка.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборСчетДоверительногоУправления = ОтборДинамическогоСписка.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборДатаНачала       = ОтборДинамическогоСписка.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборДатаОкончания1   = ОтборДинамическогоСписка.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборДатаОкончания2   = ОтборДинамическогоСписка.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	
	ОтборВидОтчета.ЛевоеЗначение      = Новый ПолеКомпоновкиДанных("ИсточникОтчета");
	ОтборОрганизация.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных("Организация");
	ОтборСчетДоверительногоУправления.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных("СчетДоверительногоУправления");
	ОтборДатаНачала.ЛевоеЗначение     = Новый ПолеКомпоновкиДанных("ДатаНачала");
	ОтборДатаОкончания1.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДатаОкончания");
	ОтборДатаОкончания2.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДатаОкончания");
	
	Если НЕ ЗначениеЗаполнено(Форма.Организация) Тогда
		ОтборОрганизация.Использование = Ложь;
	Иначе
		ОтборОрганизация.Использование  = Истина;
		ОтборОрганизация.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
		ОтборОрганизация.ПравоеЗначение = Форма.Организация;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Форма.СчетДоверительногоУправления) Тогда
		ОтборСчетДоверительногоУправления.Использование = Ложь;
	Иначе
		ОтборСчетДоверительногоУправления.Использование  = Истина;
		ОтборСчетДоверительногоУправления.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
		ОтборСчетДоверительногоУправления.ПравоеЗначение = Форма.СчетДоверительногоУправления;
	КонецЕсли;
	
	Если Форма.ВидОтчета = "" Тогда
		ОтборВидОтчета.Использование = Ложь;
	Иначе
		ОтборВидОтчета.Использование  = Истина;
		ОтборВидОтчета.ВидСравнения   = ВидСравненияКомпоновкиДанных.ВСписке;//Равно;
		СписокВидовОтчета = Новый СписокЗначений();
		СписокВидовОтчета.Добавить(Форма.ВидОтчета);
		Если Форма.ВидОтчета = "РегламентированныйОтчетБаланс" Тогда
			СписокВидовОтчета.Добавить("РегламентированныйОтчетБалансРСБУ");
		ИначеЕсли Форма.ВидОтчета = "РегламентированныйОтчетОФинансовыхРезультатах" Тогда 
			СписокВидовОтчета.Добавить("РегламентированныйОтчетОФинансовыхРезультатахРСБУ");
		КонецЕсли;
		ОтборВидОтчета.ПравоеЗначение = СписокВидовОтчета;//Форма.ВидОтчета;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Форма.ПериодОтчета) Тогда
		ОтборДатаНачала.Использование = Ложь;
		ОтборДатаОкончания1.Использование = Ложь;
		ОтборДатаОкончания2.Использование = Ложь;
	Иначе
		Если ЗначениеЗаполнено(Форма.НачалоПериода) Тогда
			ОтборДатаНачала.Использование      = Истина;
			ОтборДатаНачала.ВидСравнения       = ?(Форма.ТолькоУказанныйПериод, ВидСравненияКомпоновкиДанных.Равно, ВидСравненияКомпоновкиДанных.БольшеИлиРавно);
			ОтборДатаНачала.ПравоеЗначение     = ?(Форма.ТолькоУказанныйПериод, Форма.НачалоПериода, НачалоГода(Форма.НачалоПериода));
			
			ОтборДатаОкончания1.Использование  = НЕ Форма.ТолькоУказанныйПериод;
			ОтборДатаОкончания1.ВидСравнения   = ВидСравненияКомпоновкиДанных.Больше;
			ОтборДатаОкончания1.ПравоеЗначение = Форма.НачалоПериода;
		Иначе
			ОтборДатаНачала.Использование      = Ложь;
			ОтборДатаОкончания1.Использование  = Ложь;
		КонецЕсли;
		Если ЗначениеЗаполнено(Форма.КонецПериода) Тогда
			Если Форма.ТолькоУказанныйПериод Тогда
				ОтборДатаОкончания1.Использование  = Истина;
				ОтборДатаОкончания1.ВидСравнения   = ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
				ОтборДатаОкончания1.ПравоеЗначение = НачалоДня(Форма.КонецПериода);
			КонецЕсли;
			
			ОтборДатаОкончания2.Использование  = Истина;
			ОтборДатаОкончания2.ВидСравнения   = ВидСравненияКомпоновкиДанных.МеньшеИлиРавно;
			ОтборДатаОкончания2.ПравоеЗначение = Форма.КонецПериода;
		Иначе
			ОтборДатаОкончания2.Использование  = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	ОтборДинамическогоСписка.ИдентификаторПользовательскойНастройки = Строка(Новый УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборВидОтчетаОчистка(Элемент, СтандартнаяОбработка)
	
	УстановитьОтборы(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	// Проверим соответствие организации и счета д/у
	
	Если ЗначениеЗаполнено(ЭтаФорма.СчетДоверительногоУправления) Тогда
		Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭтаФорма.СчетДоверительногоУправления, "Организация") <> ЭтаФорма.Организация Тогда
			ЭтаФорма.СчетДоверительногоУправления = Неопределено;		
		КонецЕсли;
	КонецЕсли;	
	
	УстановитьОтборы(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если Лев(ИмяСобытия, 6) = "Запись" Тогда
		
		Элементы.Отчеты.Обновить();
		Если ИмяСобытия = "ЗаписьНовогоРегламентированногоОтчета" Тогда
			Элементы.Отчеты.ТекущаяСтрока = Параметр.Ключ;
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОтчетыПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	СписокВидовОтчетов = Документы.РегламентированныйОтчет.ПолучитьСписокВидовРегламентированныхОтчетов();
	
	ОписаниеТиповСтрока = Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(254));
	
	ТаблицаЗначений = Новый ТаблицаЗначений;
	ТаблицаЗначений.Колонки.Добавить("ИсточникОтчета", ОписаниеТиповСтрока);
	ТаблицаЗначений.Колонки.Добавить("ВыбраннаяФорма", ОписаниеТиповСтрока);
	ТаблицаЗначений.Колонки.Добавить("РедакцияФормы", ОписаниеТиповСтрока);
	
	Для каждого ТекВидОтчета Из СписокВидовОтчетов Цикл
	
		ТаблицаФормТекущегоОтчета = Отчеты[ТекВидОтчета.Значение].ТаблицаФормОтчета();
		
		Для каждого ТекСтрока Из ТаблицаФормТекущегоОтчета Цикл
		
			НоваяСтрока = ТаблицаЗначений.Добавить();
			НоваяСтрока.ИсточникОтчета = ТекВидОтчета.Значение;
			НоваяСтрока.ВыбраннаяФорма = ТекСтрока.ФормаОтчета;
			НоваяСтрока.РедакцияФормы = СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(ТекСтрока.РедакцияФормы, " (МСФО 9, НКО)", ""), " (МСФО 39, НКО)", ""), " (МСФО 9, АО)", ""), " (МСФО 39, АО)", "");
			
		КонецЦикла; 
	
	КонецЦикла;
	
	ТаблицаЗначений.Свернуть("ИсточникОтчета, ВыбраннаяФорма, РедакцияФормы");
	
	Для каждого ТекСтрока Из Строки Цикл
		
		Если ЗначениеЗаполнено(ТекСтрока.Значение.Данные.РедакцияФормы) Тогда
			Продолжить;
		КонецЕсли;
		
		Отбор = Новый Структура("ИсточникОтчета, ВыбраннаяФорма");
		ЗаполнитьЗначенияСвойств(Отбор, ТекСтрока.Значение.Данные.Ссылка);
		НайденныеСтроки = ТаблицаЗначений.НайтиСтроки(Отбор);
		Если НайденныеСтроки.Количество() = 1 Тогда
		
			ТекСтрока.Значение.Данные.РедакцияФормы = НайденныеСтроки[0].РедакцияФормы + " (автоопределение)";
		
		КонецЕсли; 
	
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтатусЧерновик(Команда)
	ИзменитьСтатус("Черновик");
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтатусГотов(Команда)
	ИзменитьСтатус("Готов");
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтатусОтправлен(Команда)
	ИзменитьСтатус("Отправлен");
КонецПроцедуры

&НаСервере
Процедура ИзменитьСтатус(Статус)

	Для каждого ВыделеннаяСтрока Из Элементы.Отчеты.ВыделенныеСтроки Цикл
	
		Документ = ВыделеннаяСтрока.ПолучитьОбъект();
		Документ.СтатусОтчета = Статус;
		Документ.НомерКорректировки = 0;
		Документ.Записать();
	
	КонецЦикла; 
	
	Элементы.Отчеты.Обновить();

КонецПроцедуры
